---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BadRailingsProfile
source: html/6ce5ff23-2b10-0a99-3ed0-90d863c76935.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BadRailingsProfile Property

Rail profile must have one closed loop. Wrong profile will not be shown in profiles list for rail definition.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadRailingsProfile { get; }
```